tap "achannarasappa/tap"
tap "gabrielepalma/tools"
tap "git-chglog/git-chglog"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "nonchalant/appicon"
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally 🚀
brew "act"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Cross-platform make
brew "cmake"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# NaCl networking and cryptography library
brew "libsodium"
# Secure Reliable Transport
brew "srt"
# Command-line fuzzy finder written in Go
brew "fzf"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Install various Ruby versions and implementations
brew "ruby-build"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby@2.5"
# Generate Markdown files from inline source code documentation
brew "sourcedocs"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# General-purpose lossless data-compression library
brew "zlib"
# Terminal stock ticker with live updates and position tracking
brew "achannarasappa/tap/ticker"
# Generation of iOS AppIcon.appiconset made easy
brew "nonchalant/appicon/appicon"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
